In [1]:
import dhlab.nbtext as nb

In [3]:
sme = nb.book_urn(lang='sme', limit =100)

In [9]:
sms = nb.book_urn(lang='sms', limit =100)

In [4]:
res = nb.get_aggregated_corpus([x[0] for x in sme])
res.head()

                   0
.             111298
,              90266
ja             47356
'              34301
-              18332
...              ...
hogremangler       1
hog                1
hoavrista          1
hoappo             1
0,38               1

[228776 rows x 1 columns]

In [11]:
ress = nb.get_aggregated_corpus([x[0] for x in sms])
ress

                0
'           18435
.            6567
,            5210
da           1944
"            1239
...           ...
sionVmnast      1
siommnid        1
siom'mnåst      1
sioltteem       1
06355           1

[16163 rows x 1 columns]

In [12]:
top50 = lambda res: [x for x in res.head(50).index if x.isalpha()]

In [13]:
top50(res)

['ja',
 'lea',
 'leat',
 'go',
 'ahte',
 'lei',
 'de',
 'dan',
 'ii',
 'dat',
 'nu',
 'mii',
 'i',
 'maid',
 'son',
 'ledje',
 'Ja',
 'læ',
 'a',
 'gal',
 'fl',
 'muhto',
 'su',
 'birra',
 'lean',
 'dahje',
 'Dat',
 'Son',
 'ge',
 's']